

class Car {
    weak var driver: Man?

    deinit{//выведем в консоль сообщение о том, что объект удален
    print("Машина удалена из памяти")
    }
}

class Man {
    weak var myCar: Car?

    deinit{//выведем в консоль сообщение о том, что объект удален
    print("Мужчина удален из памяти")
   }
}

//Объявим переменные как опциональные, что бы иметь возможность присвоить им nil

var car: Car? = Car()
var man: Man? = Man() 
//Машина теперь имеет ссылку на машину

car?.driver = man

//А мужчина на машину

man?.myCar = car

//Присвоим nil переменным, удалим эти ссылки

car = nil

man = nil

//Мы больше не можем никак обратиться к нашим объектам, но они продолжают существовать в памяти